Output of `make plan`:
```
Terraform will perform the following actions:

  # module.quasar.aws_directory_service_directory.vpn-ad must be replaced
-/+ resource "aws_directory_service_directory" "vpn-ad" {
      ~ access_url        = "d-9067021d91.awsapps.com" -> (known after apply)
      ~ alias             = "d-9067021d91" -> (known after apply)
      ~ dns_ip_addresses  = [
          - "10.255.100.107",
          - "10.255.101.43",
        ] -> (known after apply)
        edition           = "Standard"
        enable_sso        = false
      ~ id                = "d-9067021d91" -> (known after apply)
      ~ name              = "ad.d12g.co" -> "ad.ds.internal" # forces replacement
        password          = (sensitive value)
      ~ security_group_id = "sg-0d8c58ab7e13f3534" -> (known after apply)
      ~ short_name        = "ad" -> (known after apply)
      ~ size              = "Small" -> (known after apply)
      - tags              = {} -> null
        type              = "MicrosoftAD"

        vpc_settings {
            subnet_ids = [
                "subnet-165c315f",
                "subnet-be42f093",
            ]
            vpc_id     = "vpc-4e8dc229"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```